Examples/groovyBC/pulsedPitzDaily/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application oodles;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.1;

deltaT          1e-05;

writeControl    timeStep;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

functions
(
    probes1
    {
        // Type of functionObject
        type probes;

        outputControl   timeStep;
        outputInterval  1;

        // Where to load it from (if not already in solver)
        functionObjectLibs ("libsampling.so");

        // Locations to be probed. runTime modifiable!
        probeLocations
        (
            (0.0254 0.0253 0.0)
            (0.0508 0.0253 0.0)
            (0.0762 0.0253 0.0)
            (0.1016 0.0253 0.0)
            (0.1270 0.0253 0.0)
            (0.1524 0.0253 0.0)
            (0.1778 0.0253 0.0)
        );

        // Fields to be probed. runTime modifiable!
        fields
        (
            p
        );
    }

    fieldAverage1
    {
        // Type of functionObject
        type fieldAverage;

        // Where to load it from (if not already in solver)
        functionObjectLibs ("libfieldFunctionObjects.so");

        outputControl   outputTime;

        // Fields to be  averaged - runTime modifiable
        fields
        (
            U
            {
                mean            on;
                prime2Mean      on;
                base            time;
            }
            p
            {
                mean            on;
                prime2Mean      on;
                base            time;
            }
        );
    }
);

libs ( "libOpenFOAM.so" "libgroovyBC.so" ) ;

// ************************************************************************* //
