Examples/groovyBC/pulsedPitzDaily/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet           
    {
//         type            turbulentInlet;
//         referenceField  uniform (10 0 0);
//         fluctuationScale (0.02 0.01 0.01);
      type            groovyBC;
      variables "yp=pts().y;minY=min(yp);maxY=max(yp);para=-(maxY-pos().y)*(pos().y-minY)/(0.25*pow(maxY-minY,2))*normal();";
      valueExpression "10*(1+0.5*sin(500*time()))*para";
      //      valueExpression   "vector(10,0,0)+sin(100*time())*vector(1,0,0)+vector(pos().y-p*1e-10,0,0)";
      //      valueExpression   "1e5*vector((pos().y-min(pos().y))*(max(pos().y)-pos().y),0,0)";
      //      valueExpression   "((pos().y-min(pos().y))>(0.25*(max(pos().y)-min(pos().y)))) && ((max(pos().y)-pos().y)>(0.25*(max(pos().y)-min(pos().y)))) ? vector(10,0,0) : vector(0,0,0)";
      // valueExpression   "10*(1+0.5*sin(500*time()))*vector((pos().y-min(pos().y))*(max(pos().y)-pos().y),0,0)/(0.25*pow(max(pos().y)-min(pos().y),2))";
      // valueExpression   "((pos().y-min(pos().y))>(0.25*(max(pos().y)-min(pos().y)))) && ((max(pos().y)-pos().y)>(0.25*(max(pos().y)-min(pos().y)))) ? vector(10,0,0) : vector(0,0,0)";
      //      valueExpression   "((pos().y-min(pos().y))>(0.25*(max(pos().y)-min(pos().y)))) && ((max(pos().y)-pos().y)>(0.25*(max(pos().y)-min(pos().y)))) ? vector(10,0,0) : vector(0,0,0)";
      // valueExpression "-10*normal()";
      //      valueExpression "(randNormal()-1e1)*normal()";

        value           uniform (10 0 0);
    }

    outlet          
    {
      type            groovyBC;
      valueExpression "vector(0,0,0)";
      gradientExpression "vector(0,0,0)";
      fractionExpression "(phi > 0) ? 0 : 1";

//         type            inletOutlet;
//         inletValue      uniform (0 0 0);
      value           uniform (0 0 0);
    }

    upperWall       
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    lowerWall       
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    frontAndBack    
    {
        type            empty;
    }
}

// ************************************************************************* //
